* Index
** Viaje 2021                                                           :ATTACH:
:PROPERTIES:
:ID:       efacbe38-c11f-42e5-afc7-de544f7844b9
:DIR:      ~/brain/.files/
:END:

Our trip to South America!

*** Expenses
#+NAME: expenses
| Date | Name                     | Category  | Country | Amount(MXN) |
|------+--------------------------+-----------+---------+-------------|
| N/A  | Backpacks + Camping Gear | Camping   | N/A     |       24701 |
| N/A  | Flights                  | Transport | N/A     |       12600 |
|------+--------------------------+-----------+---------+-------------|
|      |                          |           |         |       37301 |
#+TBLFM: @>$5=vsum(@I..@II)

Filter expenses table. Replace val with country name to filter by country and col with column number to edit change filter results. To generate and show multiple filters use #+CALL: my-filter2(tbl=table1, val="CN") :colnames. [[https://emacs.stackexchange.com/questions/20129/how-can-i-filter-table-in-org-mode][Details]]

#+NAME: filter-expenses
#+BEGIN_SRC elisp :var tbl=expenses col=3 val="USA" :colnames y
    (cl-loop for row in tbl
          if (equal (nth col row) val)
          collect row into newtbl
          finally return newtbl)
#+END_SRC

*** Countries
**** Colombia

Generate expenses summary for country.
#+CALL: filter-expenses(val="Colombia") :colnames y
